mslawicz/WB55_Zigbee_Srv/STM32_WPAN/App/app_zigbee.c
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 6 ColorControl server 1 move_to_color_temp 1 */
}

/* ColorControl server color_loop_set 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_color_loop_set(struct ZbZclClusterT *cluster, struct ZbZclColorClientColorLoopSetReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 7 ColorControl server 1 color_loop_set 1 */
  APP_DBG("colorControl_server_1_color_loop_set; a=%d, d=%d, m=%d, o=%d, h=%d, t=%d, f=%d", req->action, req->direction, req->mask, req->override, req->start_hue, req->transition_time, req->update_flags);
  if(req->update_flags & ZCL_COLOR_LOOP_FLAG_UPDATE_ACTION)
  {
    (void)ZbZclAttrIntegerWrite(cluster, ZCL_COLOR_ATTR_COLOR_LOOP_ACTIVE,req->action);
  }
  if(req->update_flags & ZCL_COLOR_LOOP_FLAG_UPDATE_DIRECTION)
  {
    (void)ZbZclAttrIntegerWrite(cluster, ZCL_COLOR_ATTR_COLOR_LOOP_DIR,req->direction);
  }  
  if(req->update_flags & ZCL_COLOR_LOOP_FLAG_UPDATE_TIME)
  {
    (void)ZbZclAttrIntegerWrite(cluster, ZCL_COLOR_ATTR_COLOR_LOOP_TIME,req->transition_time);
  }
  if(req->update_flags & ZCL_COLOR_LOOP_FLAG_UPDATE_START_HUE)
  {
    (void)ZbZclAttrIntegerWrite(cluster, ZCL_COLOR_ATTR_COLOR_LOOP_START_HUE,req->start_hue);
  }     
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 7 ColorControl server 1 color_loop_set 1 */
}

/* ColorControl server stop_move_step 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_stop_move_step(struct ZbZclClusterT *cluster, struct ZbZclColorClientStopMoveStepReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 8 ColorControl server 1 stop_move_step 1 */
  APP_DBG("colorControl_server_1_stop_move_step");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 8 ColorControl server 1 stop_move_step 1 */
}

/* ColorControl server move_color_temp 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_move_color_temp(struct ZbZclClusterT *cluster, struct ZbZclColorClientMoveColorTempReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 9 ColorControl server 1 move_color_temp 1 */
  APP_DBG("colorControl_server_1_move_color_temp");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 9 ColorControl server 1 move_color_temp 1 */
}

/* ColorControl server step_color_temp 1 command callback */
static enum ZclStatusCodeT colorControl_server_1_step_color_temp(struct ZbZclClusterT *cluster, struct ZbZclColorClientStepColorTempReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 10 ColorControl server 1 step_color_temp 1 */
  APP_DBG("colorControl_server_1_step_color_temp");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 10 ColorControl server 1 step_color_temp 1 */
}

/* LevelControl server move_to_level 1 command callback */
static enum ZclStatusCodeT levelControl_server_1_move_to_level(struct ZbZclClusterT *cluster, struct ZbZclLevelClientMoveToLevelReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 11 LevelControl server 1 move_to_level 1 */
  APP_DBG("levelControl_server_1_move_to_level; lvl=%d, transTime=%d, onOff=%d", req->level, req->transition_time, req->with_onoff);
  RGB_params.targetLevel = req->level;
  RGB_params.transitionTime = req->transition_time;

  if((req->with_onoff) && (RGB_params.isOn == FALSE) && (RGB_params.targetLevel > 0))
  {
    /* switch the device on and change level */
    RGB_params.currentLevel = 0;
    ZbZclAttrIntegerWrite(cluster, ZCL_ONOFF_ATTR_ONOFF, 1);
    APP_DBG("levelControl_server_1_move_to_level -> device on request");
    tx_event_flags_set(&rgb_driver_flags, RGB_SWITCH_ON, TX_OR);
  }
  else if((req->with_onoff) && (RGB_params.isOn == TRUE) && (RGB_params.targetLevel == 0))
  {
    /* change level and switch the device Off */
    ZbZclAttrIntegerWrite(cluster, ZCL_ONOFF_ATTR_ONOFF, 0);
    APP_DBG("levelControl_server_1_move_to_level -> device off request");
    tx_event_flags_set(&rgb_driver_flags, RGB_SWITCH_OFF, TX_OR);
  }
  else if(RGB_params.isOn == TRUE)
  {
    /* change level only */
    tx_event_flags_set(&rgb_driver_flags, RGB_LVL_CHG_REQUEST, TX_OR);
  }
  else
  {
    /* ignore when device is off and with_onoff argument is false */
    APP_DBG("levelControl_server_1_move_to_level ignored - device is off");
  }

  ZbZclAttrIntegerWrite(cluster, ZCL_LEVEL_ATTR_CURRLEVEL, RGB_params.targetLevel);

  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 11 LevelControl server 1 move_to_level 1 */
}

/* LevelControl server move 1 command callback */
static enum ZclStatusCodeT levelControl_server_1_move(struct ZbZclClusterT *cluster, struct ZbZclLevelClientMoveReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 12 LevelControl server 1 move 1 */
  APP_DBG("levelControl_server_1_move");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 12 LevelControl server 1 move 1 */
}

/* LevelControl server step 1 command callback */
static enum ZclStatusCodeT levelControl_server_1_step(struct ZbZclClusterT *cluster, struct ZbZclLevelClientStepReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 13 LevelControl server 1 step 1 */
  APP_DBG("levelControl_server_1_step");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 13 LevelControl server 1 step 1 */
}

/* LevelControl server stop 1 command callback */
static enum ZclStatusCodeT levelControl_server_1_stop(struct ZbZclClusterT *cluster, struct ZbZclLevelClientStopReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 14 LevelControl server 1 stop 1 */
  APP_DBG("levelControl_server_1_stop");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 14 LevelControl server 1 stop 1 */
}

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_Init(void)
{
  SHCI_CmdStatus_t ZigbeeInitStatus;
  UINT ThreadXStatus;
  CHAR * pTempBuf = TX_NULL;

  APP_DBG("APP_ZIGBEE_Init");

  /* Check the compatibility with the Coprocessor Wireless Firmware loaded */
  APP_ZIGBEE_CheckWirelessFirmwareInfo();

  /* Register cmdbuffer */
  APP_ZIGBEE_RegisterCmdBuffer(&ZigbeeOtCmdBuffer);

  /* Init config buffer and call TL_ZIGBEE_Init */
  APP_ZIGBEE_TL_INIT();

  /* Initialize the mutex */
  tx_mutex_create(&MtxZigbeeId, "MtxZigbeeId", TX_NO_INHERIT);

  /* Initialize the semaphores */
  tx_semaphore_create(&StartupEndSemaphore, "StartupEndSemaphore", 0); /*< Create the semaphore and make it busy at initialization */
  tx_semaphore_create(&TransferToM0Semaphore, "TransferToM0Semaphore", 0);
  tx_semaphore_create(&NWKFormSemaphore, "NWKFormSemaphore", 0);
  tx_semaphore_create(&NWKFormWaitSemaphore, "NWKFormWaitSemaphore", 0);
  tx_semaphore_create(&NotifyM0ToM4Semaphore, "NotifyM0ToM4Semaphore", 0);
  tx_semaphore_create(&RequestM0ToM4Semaphore, "RequestM0ToM4Semaphore", 0);

  /* Create the Timer service */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &TimerID, hw_ts_SingleShot, APP_ZIGBEE_TimingElapsed);

  /* Register task */
  /* Create the different tasks */
  tx_byte_allocate(pBytePool, (VOID**) &pTempBuf, THREADX_STACK_SIZE_LARGE, TX_NO_WAIT);
  ThreadXStatus = tx_thread_create(&OsTaskNotifyM0ToM4Id,
                                   "NotifyM0ToM4Id",
                                   APP_ZIGBEE_ProcessNotifyM0ToM4,
                                   0,
                                   pTempBuf,
                                   THREADX_STACK_SIZE_LARGE,
                                   NOTIFY_M0_TO_M4_PRIORITY,
                                   NOTIFY_M0_TO_M4_PRIORITY,
                                   TX_NO_TIME_SLICE,
                                   TX_AUTO_START);
  if (ThreadXStatus != TX_SUCCESS)
  {
    APP_ZIGBEE_Error(ERR_ZIGBEE_THREAD_X_FAILED, 1);
  }

  tx_byte_allocate(pBytePool, (VOID**) &pTempBuf, THREADX_STACK_SIZE_LARGE, TX_NO_WAIT);
  ThreadXStatus = tx_thread_create(&OsTaskRequestM0ToM4Id,
                                   "RequestM0ToM4Id",
                                   APP_ZIGBEE_ProcessRequestM0ToM4,
                                   0,
                                   pTempBuf,
                                   THREADX_STACK_SIZE_LARGE,
                                   REQUEST_M0_TO_M4_PRIORITY,
                                   REQUEST_M0_TO_M4_PRIORITY,
                                   TX_NO_TIME_SLICE,
                                   TX_AUTO_START);
  if (ThreadXStatus != TX_SUCCESS)
  {
    APP_ZIGBEE_Error(ERR_ZIGBEE_THREAD_X_FAILED, 1);
  }

